'''
Урок 2. Задание 3. Пользователь вводит месяц в виде целого числа от 1 до 12. 
Сообщить к какому времени года относится месяц (зима, весна, лето, осень). 
Решение через dict.
'''
#Вариант №1 (В одну строку, без защиты от дурака, при корректном вводе)
print({1:"зима", 2:"зима", 3:"весна", 4:"весна", 5:"весна", 6:"лето", 7:"лето", 8:"лето", 
	9:"осень", 10:"осень", 11:"осень", 12:"зима"}[int(input("Введите номер месяца(от 1 до 12):"))])
'''
Вариант №1 (без защиты от дурака, при корректном вводе)
seasons = {1:"зима", 2:"зима", 3:"весна", 4:"весна", 5:"весна", 6:"лето",
7:"лето", 8:"лето", 9:"осень", 10:"осень", 11:"осень", 12:"зима"}
while True:
  a = input("Введите номер месяца года от 1 до 12:")
  if a not in ("1","2","3","4","5","6","7","8","9","10","11","12"):
    print("Некорректный ввод!")
  else:
    print(seasons[int(a)])
  flag = input("Попробуете ещё? (Да/Нет), Y/N:")
  if flag.lower() in ("да", "lf", "y", "н", "yes"):
    continue
  else: break
print("До свидания!")

Вариант №3
seasons = {1:"зима", 2:"зима", 3:"весна", 4:"весна", 5:"весна", 6:"лето",
7:"лето", 8:"лето", 9:"осень", 10:"осень", 11:"осень", 12:"зима"}
a = int(input("Введите номер месяца(от 1 до 12):"))
if a in seasons.keys():
  print(seasons[a])
'''