'''
3. Пользователь вводит месяц в виде целого числа от 1 до 12. 
Сообщить к какому времени года относится месяц (зима, весна, лето, осень). 
Напишите решения через list и через dict.

# Вариант № 1
lst = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", 
"осень", "осень", "осень", "зима"]
a = int(input("Введите номер месяца года от 1 до 12: "))
print(lst[a-1])

# Вариант № 2
lst = ['зима', 'весна', 'лето', 'осень']
a = input("Введите номер месяца года от 1 до 12:")
if a not in ("1","2","3","4","5","6","7","8","9","10","11","12"):
  print("Некорректный ввод!")
elif int(a) in (1, 2, 12):
	print(lst[0])
elif int(a) in (3, 4, 5):
	print(lst[1])
elif int(a) in (6, 7, 8):
	print(lst[2])
elif int(a) in (9, 10, 11):
	print(lst[3])
'''
# Вариант № 3
lst = ["зима", "зима", "весна", "весна", "весна", "лето", "лето", "лето", 
"осень", "осень", "осень", "зима"]
while True:
  a = input("Введите номер месяца года от 1 до 12:")
  if a not in ("1","2","3","4","5","6","7","8","9","10","11","12"):
    print("Некорректный ввод!")
  else:
    print(lst[int(a)-1])
  flag = input("Попробуете ещё? (Да/Нет), Y/N:")
  if flag.lower() in ("да", "lf", "y", "н", "yes"):
    continue
  else: break
print("До свидания!")
